require("dotenv").config()

let usersNEW = {"メᥱⲙꪗ᥈ꪉ":"10.2k","Ýogi ßruh ツ":"6.1k","Freedom Fighter":"4.9k","ItsIzzy":"4.5k","༒ᏢꮠⷡꭲⷷꭼᷤꭱⷮᏞꓴᏢᎬ№႙႙༒":"3.6k","༒Ǥ۝۝ᗪωᎥη༒࿐[༒Ǥ༒]":"3.4k","☭ﾁꪋຂꪗ₂₀₁₂":"3.1k","TS prog":"3k","• ⌜ ʟᴇᴇ ⌟ •":"2.7k","★₱ꭼꭲꭱøꪜꮠḉꫝ★":"2.4k","Natali BLR":"2.2k","F4cplayer":"2.1k","AK prajapati":"2k","Deadpool 😈":"1.9k","ᨏⅼꪀꬵ᰻ꪀ᰻ϯꮛᨏ":"1.8k","Гордый Птиц":"1.8k","༒Kıռɠ⚔Mɾ༒":"1.6k","Daredevil":"1.5k","꧁༒ кιм 丂σєк נιη ༒꧂":"1.5k","☆DAN☆ᵖᵉᵃᶜᵉᵐᵃᵏᵉʳ":"1.4k","👑❤𝕶𝕺𝕽𝕺𝕷𝕰𝖁𝕬ᴮᴬᴷᵁ☪❤👑":"1.4k","ꪑꮉ.ゐꫀꪖꪜꫀꮉ⁹¹¹":"1.4k","lumby":"1.3k","ABHI":"1.2k","★᭄ᏦꮪꭼⷨɴᷬꮠᷤꭹᷤᎪ★᭄":"1.2k","ᴾᴿᴼシꕶᎻᎬᏒ™࿐":"1.1k","heyracer":"1.1k","ꪝꪹડꫝ♛ꪑꪋહϯᥱꮉᴺᵉᵒⁿ":"1k","susmaster69":"959","𑇍ꮓꭺᴃⷭꭷⷧꮠⷶꮪⷡꮋⷶꮠꮶ𑇍":"969","Yohannan/John":"918","shaquilla .oatmeal.":"912","GenericWolfe":"783","&lt; A N I L &gt;":"768","[YOUTHOOBER]Soumya Kant Beshra":"743","Nik Dik":"733","Sumit":"719","Matwor23":"724","╰⁔╯Ɱ Λ Ꞙ ⚚ ⨁ ꓢ 🜲 𐙋ᵇᵉᵗᵅ𐙋":"702","ᶦᶰᵈ᭄꧁༒₮ɆⱤᗰł₦₳₮ØⱤ༒꧂ⓌⓌⒽ":"693","diet_panda":"677","kreenagr":"665","Galaxy_47_ronin":"632","ERLANTZ AKUNA":"631","Skat":"609","!   ✦͜͡҈ᴊ 𝙺𝙰𝙽𝙶 𝙿𝚄𝙺𝚄𝙻🐱":"536","Basya UA":"522","•A᷈ҲҼ༽⛧༼ƓⱤÎƝƊҼƦ•":"522","Sergeant":"527","དᵃˡᵖʰᵃཌSilent Warrior":"512","༒ExLegionary༒":"481","꧁༒Gun Master WWH༒꧂":"467","KAZIMIRyoutube":"464","xX_brianity_Xx":"426","☬О҉Х҉О҉Т҉Н҉И҉К҉☬":"412","ANIKET WWH":"404","ꪊઢꭷ℘ꮂꮋ[ꓠᎬᎧꓠ]":"399","i live in your attic":"400","Ƙꪋꪔ᱈꘥ꪋᜎƙꪋ[⚞ᮙᮄ⚟]":"401","✭ß๖ᚼҩ†ᕠບັ✭ [⚞ᮙᮄ⚟]":"390","༒ExFennsu༒":"360","✯☭Pavel SVK☭✯":"354","boiroblos":"349","★᭄ꪑỉ᥉᥉.ꪜꪖꪶꫀꪹỉꪖ★᭄":"314","BLADE -ГРУ":"313","☠ꯏⲁⲧꤎ☠":"310","BenAslındaYoğum":"299","ゆꮉꭷ✰Ꮹꪹꮉꪶ":"298","FBMAMS🍌":"291","Part west african":"291","༒̵К̵А̴М̶П̷О̴Т̸༒̶ ¹³":"279","nier":"297","༒ℯℒℯℴℕ  ⷦ ⷠ ⷩ༒":"254","ᎮᏒᏫᎢᏋᏚᎢ":"252","Jd-fors":"251","Halloween":"242","CkorazonDantes69":"240","ʞɐuиɯɐн ʞǝнɹʎdʎ":"237","Лёха DE+KZ. ( Алексей.)":"238","ϟTRMɱơŋąɧ":"235","LOL LOL 2.O":"229","AzurInteractive is a scammer":"225","SuchasaRipova":"219","𝔖𝔠𝔥𝔫𝔢𝔩𝔩𝔣𝔢𝔲𝔢𝔯":"226","CRISP_SOM (KING)":"223","[ᙘᙍᏕ༒] ༒ᜥꪮꪶꪗꪋꫝᵇᵉᶳᶵꪝꪹꫝ༒":"223","ᴺᵉᵒⁿ࿆ᒍᥱꪀꭰ᥆ડ✈":"212","WWH-MSO":"206","(RED) BOBAH":"201","Сергей Викторович":"200","LOL YOU DIEDᶠᵗᵗᵉ":"192","zecariothz":"188","1st Lt. Bilko":"186","Бобби":"190","МОНСТР BY":"185","Sss7":"199","К о М и с С а р":"187","Flufi":"180","࿐Saif༄":"180"}
let usersOLD = {"メᥱⲙꪗ᥈ꪉ":"9k","Freedom Fighter":"4.6k","Ýogi ßruh ツ":"3.9k","༒Ǥ۝۝ᗪωᎥη༒࿐[༒Ǥ༒]":"3.1k","༒ᏢꮠⷡꭲⷷꭼᷤꭱⷮᏞꓴᏢᎬ№႙႙༒":"3.1k","ItsIzzy":"2.9k","TS prog":"2.4k","☭ﾁꪋຂꪗ₂₀₁₂":"2.3k","★₱ꭼꭲꭱøꪜꮠḉꫝ★":"2.1k","AK prajapati":"2k","Natali BLR":"1.9k","• ⌜ ʟᴇᴇ ⌟ •":"1.9k","Гордый Птиц":"1.8k","༒Kıռɠ⚔Mɾ༒":"1.4k","ᨏⅼꪀꬵ᰻ꪀ᰻ϯꮛᨏ":"1.4k","👑❤𝕶𝕺𝕽𝕺𝕷𝕰𝖁𝕬ᴮᴬᴷᵁ☪❤👑":"1.3k","ꪑꮉ.ゐꫀꪖꪜꫀꮉ⁹¹¹":"1.2k","Deadpool 😈":"997","☆DAN☆ᵖᵉᵃᶜᵉᵐᵃᵏᵉʳ":"974","ABHI":"975","lumby":"963","F4cplayer":"926","꧁༒ кιм 丂σєк נιη ༒꧂":"876","★᭄ᏦꮪꭼⷨɴᷬꮠᷤꭹᷤᎪ★᭄":"828","Daredevil":"815","𑇍ꮓꭺᴃⷭꭷⷧꮠⷶꮪⷡꮋⷶꮠꮶ𑇍":"808","&lt; A N I L &gt;":"756","Yohannan/John":"752","heyracer":"730","Matwor23":"722","Spooky Sowmya":"698","ꪝꪹડꫝ♛ꪑꪋહϯᥱꮉᴺᵉᵒⁿ":"692","diet_panda":"673","Nik Dik":"641","ᴾᴿᴼシꕶᎻᎬᏒ:tm:࿐":"644","GenericWolfe":"617","╰⁔╯Ɱ Λ Ꞙ ༆ ⨁ ꗟ ✵":"548","!   ✦͜͡҈ᴊ 𝙺𝙰𝙽𝙶 𝙿𝚄𝙺𝚄𝙻:cat:":"527","ERLANTZ AKUNA":"530","Basya UA":"501","Skat":"515","shaquilla .oatmeal.":"494","Sergeant":"493","༒ExLegionary༒":"464","KAZIMIRyoutube":"424","xX_brianity_Xx":"413","ꪊઢꭷ℘ꮂꮋ[ꓠᎬᎧꓠ]":"399","༒ExFennsu༒":"360","ANIKET WWH":"353","•A᷈ҲҼ༽⛧༼ƓⱤÎƝƊҼƦ•":"351","kreenagr":"307","Part west african":"291","BLADE -ГРУ":"289","Ƙꪋꪔ᱈꘥ꪋᜎƙꪋ[⚞ᮙᮄ⚟]":"285","✯☭Pavel SVK☭✯":"275","nier":"291","average_water_enjoyer":"260","✭ᚢ†ꪙϤᕹ":"257","༒ℯℒℯℴℕ  ⷦ ⷠ ⷩ༒":"254","Halloween":"242","☬О҉Х҉О҉Т҉Н҉И҉К҉☬":"246","CkorazonDantes69":"240","༒̵К̵А̴М̶П̷О̴Т̸༒̶ ¹³":"238","ϟTRMɱơŋąɧ":"235","AzurInteractive is a scammer":"225","SuchasaRipova":"219","[ᙘᙍᏕ༒] ༒ᜥꪮꪶꪗꪋꫝᵇᵉᶳᶵꪝꪹꫝ༒":"223","CRISP_SOM (KING)":"215","ᎮᏒᏫᎢᏋᏚᎢ":"202","Сергей Викторович":"200","Galaxy_47_ronin":"198","ᒍᥱꪀꭰ᥆ડ₇₁⁴⁷ʳᵘ:airplane:[ꓠᎬᎧꓠ]":"190","1st Lt. Bilko":"186","МОНСТР BY":"185","Лёха DE+KZ. ( Алексей.)":"188","Sss7":"198","(RED) BOBAH":"185","Flufi":"180","༒☭✯Ħømø sȺᵽɨɇns༒ᴸᴳᴺ":"194","ZLOI XOXOL":"162","kosu":"161","Ali Bulut":"160","Александр Семашкевич":"176","฿Ⱡ₳₵₭ ₲łⱤⱠ-ƬƦ⁐☆":"156","!JavaScript":"152","JimBeam":"151","Kubasinsky7":"150","[\"knz]major pain:flag_nz:":"144","WWH-MSO":"149","Exlibris":"147","General331":"141","Magnus Maximus":"147","手殘仔":"144","KMS SCHARNHORST":"134","слесарюга":"128","dk61russ(юФо)":"127","Rangi Tū":"123","Jd-fors":"121",":skull_crossbones:ꯏⲁⲧꤎ:skull_crossbones:":"118"}
const active = {}

for (const usersNEWKey in usersNEW) {
    const old = usersOLD[usersNEWKey]
    const newActive = usersNEW[usersNEWKey]

    console.log(old)
    console.log("NEW: ", newActive)

    if (old === newActive) {
        continue
    } else {
        let newNumber = parseFloat(newActive)
        if (newActive.includes("k")) {
            newNumber *= 1000
        }

        let oldNumber = 0
        if (old !== undefined) {
            oldNumber = parseFloat(old)
            if (old.includes("k")) {
                oldNumber *= 1000
            }
        }
        active[usersNEWKey] = newNumber - oldNumber
    }
}
const arr = Object.entries(active)
arr.sort(([, a], [, b]) => b - a)
console.log(Object.fromEntries(arr))
